{
  "common": {
    "name": "net-tools",
    "version": "1.1.1",
    "news": {
      "1.1.1": {
        "en": "Fix \"Cannot read properties of undefined (reading 'find')\"",
        "de": "Fehlerbehebung \"Cannot read properties of undefined (reading 'find')\"",
        "ru": "Исправление «Невозможно прочитать свойства неопределенного (чтение «найти»)»",
        "pt": "Corrigir \"Não é possível ler propriedades indefinidas (ler 'find')\"",
        "nl": "Fix \"Kan eigenschappen van ongedefinieerde niet lezen\"",
        "fr": "Correction \"Impossible de lire les propriétés de l'indéfini (lire 'find')\"",
        "it": "Fissare \"Non leggere le proprietà di non definito (leggendo 'find')\"",
        "es": "Arreglar \"No se pueden leer propiedades indefinidas (leer 'find')\"",
        "pl": "Naprawiono \"Nie można odczytać właściwości niezdefiniowanych (czytanie 'find')\"",
        "uk": "Фіксація \"Не можна прочитати властивості невизначеної (читання 'find')\"",
        "zh-cn": "修正“ 无法读取未定义的属性( 读取“ find” ) "
      },
      "1.1.0": {
        "en": "New feature ignore list for autodiscovery\nNew feature Wake-on-LAN with IP for devices on other subnets\nOptimize config for better responsive behavior\nSync license key on all instance configurations if a key was already entered in one instance configuration\nMoved translations from configuration interface to i18n files\nUpdate dependencies",
        "de": "Neues Feature ignorieren Liste für Autodiscovery\nNeue Funktion Wake-on-LAN mit IP für Geräte in anderen Subnetzen\nKonfiguration optimiert für Unterschiedliche Bildschirm größen\nLizenzschlüssel synchronisieren in allen Instanz-Konfigurationen, wenn ein Schlüssel bereits in einer Instanz-Konfiguration eingegeben wurde\nVerschieben von Übersetzungen von der Konfiguration nach i18n Dateien\nAbhängigkeiten aktualisiert",
        "ru": "Новая функция проигнорировать список для автоматического обнаружения\nНовая функция Wake-on-LAN с IP для устройств на других подсетях\nОптимизация конфигурации для лучшего отзывчивого поведения\nСинхронный лицензионный ключ на всех конфигурациях, если ключ уже был введен в конфигурации одного экземпляра\nПеремещение переводов с интерфейса конфигурации на i18n файлы\nЗависимости обновления",
        "pt": "Novo recurso ignora a lista de autodescoberta\nNovo recurso Wake-on-LAN com IP para dispositivos em outras sub-redes\nOtimize a configuração para melhor comportamento responsivo\nSincronizar chave de licença em todas as configurações de instância se uma chave já foi inserida em uma configuração de instância\nTraduções movidas da interface de configuração para arquivos i18n\nDependências de atualização",
        "nl": "Nieuwe functie negeert lijst voor autoontdekking\nNieuwe functie Wake-on-LAN met IP voor apparaten op andere subnetten\nConfigureren optimaliseren voor beter responsief gedrag\nLicentiesleutel synchroniseren op alle instantieconfiguraties als er al een sleutel is ingevoerd in één instantieconfiguratie\nVerplaatste vertalingen van configuratie interface naar i18n bestanden\nAfhankelijkheden bijwerken",
        "fr": "Nouvelle fonctionnalité ignorer la liste pour la découverte automatique\nNouvelle fonctionnalité Wake-on-LAN avec IP pour les appareils sur d'autres sous-réseaux\nOptimiser la configuration pour un meilleur comportement réactif\nSynchroniser la clé de licence sur toutes les configurations d'instance si une clé a déjà été saisie dans une configuration d'instance\nTranslations déplacées de l'interface de configuration vers les fichiers i18n\nMise à jour des dépendances",
        "it": "Nuova lista ignorare funzionalità per autodiscovery\nNuova funzionalità Wake-on-LAN con IP per dispositivi su altre subnet\nOttimizzare la configurazione per un migliore comportamento reattivo\nLa chiave di licenza Sync su tutte le configurazioni delle istanze se una chiave è già stata inserita nella configurazione di un'istanza\nTraduzioni spostate dall'interfaccia di configurazione ai file i18n\nDipendenze di aggiornamento",
        "es": "Nueva característica ignora lista para autodescubrimiento\nNueva función Wake-on-LAN con IP para dispositivos en otras subredes\nOptimize config for better responsive behaviour\nClave de licencia de sincronización en todas las configuraciones de instancias si una clave ya fue introducida en una configuración de instancia\nTraducciones móviles desde la interfaz de configuración a archivos i18n\nActualizar las dependencias",
        "pl": "Nowa lista ignorowania funkcji dla autoodkrycia\nNowa funkcja Wake- on- LAN z IP dla urządzeń na innych podsieciach\nOptymalizacja konfiguracji dla lepszego reagowania zachowania\nSynchronizuj klucz licencyjny na wszystkich konfiguracjach instancji, jeśli klucz został już wprowadzony w konfiguracji jednej instancji\nTłumaczenie z interfejsu konfiguracyjnego na pliki i18n\nAktualizuj zależności",
        "uk": "Нова функція ігнорування списку для автоматичногорозкриття\nНова функція Wake-on-LAN з IP для пристроїв на інших підмережах\nОптимізуйте налаштування для кращої адаптивної поведінки\nСинхронізація ліцензійного ключа на всіх налаштуваннях екземпляра, якщо ключ вже увійшов в одну конкретну конфігурацію\nПереміщені переклади з інтерфейсу конфігурації до файлів i18n\nОновлення залежності",
        "zh-cn": "新特性忽略自动发现列表\n用于其他子网设备的新功能 Wake- on-LAN\n优化配置以更好地应对行为\n如果密钥已经输入到一个实例配置中, 在所有实例配置上同步许可密钥\n将配置界面的翻译移至 i18n 文件\n更新依赖关系\n修理一些由适配器检查器修补的东西"
      },
      "1.0.11": {
        "en": "Fix high CPU load while running discovering devices",
        "de": "Behebung der hohen CPU-Last bei der Erkennung von Geräten "
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<1.0.1",
            "newVersion>=1.0.1"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!"
        },
        "text": {
          "en": "From version 1.0.1 a license is required to use the adapter. You can buy it here -> https://www.all-smart.net/produkt/iobroker-net-tools-v1-lizenz/\n If you have supported me in the past i will give you a free license, please contact me with name and Paypal address: iobroker@all-smart.net",
          "de": "Ab version 1.0.1 ist eine Lizenz erforderlich um den Adapter zu benutzen. Die Lizenz kann hier gekauft werden -> https://www.all-smart.net/produkt/iobroker-net-tools-v1-lizenz/\n Wer mich in der Vergangenheit unterstützt hat, bekommt eine kostenlose Lizenz, bitte kontaktieren Sie mich mit Namen und Paypal Adresse: iobroker@all-smart.net"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ],
    "titleLang": {
      "en": "Net tools",
      "de": "Netzwerk Werkzeuge",
      "ru": "Чистые инструменты",
      "pt": "Ferramentas de rede",
      "nl": "Netto hulpmiddelen",
      "fr": "Outils Internet",
      "it": "Strumenti della rete",
      "es": "herramientas netas",
      "pl": "Narzędzia sieciowe",
      "uk": "Чистий інструмент",
      "zh-cn": "网络工具"
    },
    "desc": {
      "en": "This adapter cyclic polls configured IPs, can send wake-on-lan packages and scan for open ports.",
      "de": "Dieser Adapter fragt zyklisch konfigurierte IPs ab, kann Wake-on-Lan-Pakete senden und nach offenen Ports suchen.",
      "ru": "Этот адаптер циклически опрашивает настроенные IP-адреса, может отправлять пакеты пробуждения по локальной сети и сканировать открытые порты.",
      "pt": "Este adaptador pesquisa cíclicamente os IPs configurados, pode enviar pacotes wake-on-lan e procurar portas abertas.",
      "nl": "Deze adapter peilt cyclisch geconfigureerde IP's, kan wake-on-lan-pakketten verzenden en scannen op open poorten.",
      "fr": "Cet adaptateur interroge cycliquement les adresses IP configurées, peut envoyer des packages wake-on-lan et rechercher les ports ouverts.",
      "it": "Questo adattatore esegue il polling ciclico degli IP configurati, può inviare pacchetti wake-on-lan ed eseguire la scansione delle porte aperte.",
      "es": "Este adaptador sondea cíclicamente las IP configuradas, puede enviar paquetes Wake-on-LAN y buscar puertos abiertos.",
      "pl": "Ten adapter cyklicznie odpytuje skonfigurowane adresy IP, może wysyłać pakiety wake-on-lan i skanować w poszukiwaniu otwartych portów.",
      "uk": "Цей адаптер циклічно опитує налаштовані IP-адреси, може надсилати пакети wake-on-lan і сканувати відкриті порти.",
      "zh-cn": "该适配器循环轮询配置的 IP，可以发送 LAN 唤醒包并扫描开放端口。"
    },
    "authors": [
      "Jey Cee <iobroker@all-smart.net>"
    ],
    "keywords": [
      "poll",
      "ping",
      "ip",
      "wake-on-lan",
      "port scan"
    ],
    "licenseInformation": {
      "license": "CC-BY-NC-4.0",
      "type": "paid",
      "link": "https://www.all-smart.net/produkt/iobroker-net-tools-v1-lizenz/"
    },
    "platform": "Javascript/Node.js",
    "icon": "net-tools.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/Jey-Cee/ioBroker.net-tools/master/admin/net-tools.png",
    "readme": "https://github.com/Jey-Cee/ioBroker.net-tools/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "network",
    "compact": true,
    "tier": 2,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "supportedMessages": {
      "deviceManager": true
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.8"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ]
  },
  "native": {
    "licenseKey": "",
    "licenseActivated": false,
    "interface": "",
    "startIp": "",
    "endIp": "",
    "autoSearch": false,
    "searchSchedule": "",
    "pingInterval": 60,
    "portScan": true,
    "portList": "20, 21, 22, 23, 25, 53, 80, 110, 119, 123, 143, 161, 162, 194, 443, 445, 3306, 3389, 5900, 6379, 8080, 8443, 9090, 9200, 9999",
    "ignoreListTable": []
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": "Net Tools"
      },
      "native": {}
    },
    {
      "_id": "localhost",
      "type": "channel",
      "common": {
        "name": "localhost"
      }
    },
    {
      "_id": "localhost.ports",
      "type": "state",
      "common": {
        "name": {
          "en": "Open ports",
          "de": "Offene Ports",
          "ru": "Открытые порты",
          "pt": "Portas abertas",
          "nl": "Open poorten",
          "fr": "Ports ouverts",
          "it": "Porte aperte",
          "es": "Puertos abiertos",
          "pl": "Otwarte porty",
          "zh-cn": "打开端口",
          "uk": "Відкриті порти"
        },
        "read": true,
        "write": false,
        "role": "list",
        "type": "array"
      }
    },
    {
      "_id": "discover",
      "type": "state",
      "common": {
        "name": {
          "en": "Discover devices",
          "de": "Geräte suchen",
          "ru": "Обнаружить устройства",
          "pt": "Descobrir dispositivos",
          "nl": "Apparaten ontdekken",
          "fr": "Découvrir les appareils",
          "it": "Scopri dispositivi",
          "es": "Descubrir dispositivos",
          "pl": "Odkryj urządzenia",
          "zh-cn": "发现设备",
          "uk": "Виявити пристрої"
        },
        "read": false,
        "write": true,
        "role": "button",
        "type": "boolean"
      }
    },
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    }
  ]
}
